# Creating DataFrames

In [24]:
data={"age":[23,24,46,13,72],
      "country":["Bulgaria","USA","USA","England","Netherlands"],
      "gender":["F","M","F","M","M"],
     "name":["Sophia","John","Jennifer","Edgar","Patrick"]}

In [25]:
data

{'age': [23, 24, 46, 13, 72],
 'country': ['Bulgaria', 'USA', 'USA', 'England', 'Netherlands'],
 'gender': ['F', 'M', 'F', 'M', 'M'],
 'name': ['Sophia', 'John', 'Jennifer', 'Edgar', 'Patrick']}

In [40]:
import pandas as pd

In [41]:
df = pd.DataFrame(data)

In [42]:
df.columns

Index(['age', 'country', 'gender', 'name'], dtype='object')

In [43]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [44]:
df.set_index("name",drop = True, inplace = True)

### Drop is written, so if we choose name as an index, it won't show it twice, as it usually does
### inplace it will save the changes in the DataFrame

In [45]:
df

          age      country gender
name
Sophia     23     Bulgaria      F
John       24          USA      M
Jennifer   46          USA      F
Edgar      13      England      M
Patrick    72  Netherlands      M

In [46]:
df.reset_index(inplace = False, drop = False)

       name  age      country gender
0    Sophia   23     Bulgaria      F
1      John   24          USA      M
2  Jennifer   46          USA      F
3     Edgar   13      England      M
4   Patrick   72  Netherlands      M